uhnp/src/Reports/ОтчетПоПроизвольномуЗапросуТек/ОтчетПоПроизвольномуЗапросуТек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоПроизвольномуЗапросуТек</name>
  <attributes>
    <name>ТабПравилаВычисленияПараметров</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолучения</name>
    <type>
      <types>EnumRef.СпособыПолученияОперандов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧтениеНеактуальныхЗаписей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

uhnp/src/Reports/ОтчетПоПроизвольномуЗапросуТек/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ВывестиОтчет()
	
	ОтчетОбъект=ПолучитьРабочийОбъект();
		
	ТабРезультат.Очистить();
	
	ДокументРезультат=ОтчетОбъект.СформироватьОтчет();
	
	ТабРезультат.Вывести(ДокументРезультат);
		
КонецПроцедуры // ВывестиОтчет()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтчетОбъект=РеквизитФормыВЗначение("Отчет");
	
	ОтчетОбъект.МассивОтборов=Параметры.МассивОтборов;
	
	Если ТипЗнч(Параметры.ПравилаВычисленияПараметровЗапроса)=Тип("Массив") Тогда
		
		ОтчетОбъект.ПравилаВычисленияПараметровЗапроса=ПроцедурыПреобразованияДанныхУХ.ПолучитьТаблицуИзМассиваСтруктур(Параметры.ПравилаВычисленияПараметровЗапроса);
		
		Для Каждого Строка ИЗ ОтчетОбъект.ПравилаВычисленияПараметровЗапроса Цикл
			
			НоваяСтрока=ОтчетОбъект.ТабПравилаВычисленияПараметров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка,,"УточнениеСпособаОпределения");
			
			НоваяСтрока.УточнениеСпособаОпределения=УправлениеОтчетамиУХ.ПолучитьЗначениеИзХранилища(Строка.УточнениеСпособаОпределения);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОтчетОбъект.СпособПолучения=Параметры.СпособПолучения;
	ОтчетОбъект.ТекстЗапроса=Параметры.ТекстЗапроса;
	ОтчетОбъект.ЧтениеНеактуальныхЗаписей=Параметры.ЧтениеНеактуальныхЗаписей;
	
	ПоместитьРабочийОбъект(ОтчетОбъект);
	
	Если Параметры.ФормироватьПриОткрытии Тогда
		
         ВывестиОтчет();
		 
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьРабочийОбъект()
	
	РабочийОбъект=РеквизитФормыВЗначение("Отчет");
	РабочийОбъект.АдресХранилищаПеременныхДляРасчета=РабочийОбъектАдрес;
	РабочийОбъект.ВосстановитьПеременныеДляРасчета();
	
	Возврат РабочийОбъект;
		
КонецФункции // ПолучитьРабочийОбъект()

&НаСервере
Процедура ПоместитьРабочийОбъект(РабочийОбъект)
	
	РабочийОбъектАдрес=ПоместитьВоВременноеХранилище(РабочийОбъект.ПодготовитьСтруктуруПеременныхДляРасчета(),ЭтаФорма.УникальныйИдентификатор);
	ЗначениеВРеквизитФормы(РабочийОбъект,"Отчет");
				
КонецПроцедуры // ПолучитьРабочийОбъект()
